Cosmic.html
<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Cosmic</title>
<meta http-equiv="Content-Type" content="text/html;charset=iso-8859-1"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-09-03 15:42:34 EDT"/>
<meta name="author" content="Greg"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Cosmic</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Cosmic </a>
<ul>
<li><a href="#sec-1.1">1.1 Abstract </a></li>
<li><a href="#sec-1.2">1.2 The Problem of Cosmic Coincidences </a></li>
<li><a href="#sec-1.3">1.3 Relational Philosophy of Mathematics </a></li>
<li><a href="#sec-1.4">1.4 Properties of Relations </a></li>
<li><a href="#sec-1.5">1.5 Possible and Actual </a></li>
<li><a href="#sec-1.6">1.6 Summary of Argument </a>
<ul>
<li><a href="#sec-1.6.1">1.6.1 Overview of what has been said so far </a></li>
</ul>
</li>
<li><a href="#sec-1.7">1.7 Bibliographic Information </a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Cosmic </h2>
<div class="outline-text-2" id="text-1">

<p>Notes on Helier Robinson's <i>Cosmic Coincidences</i>.
<a href="http://arxiv-web3.library.cornell.edu/abs/1111.4562">http://arxiv-web3.library.cornell.edu/abs/1111.4562</a>
</p>
</div>

<div id="outline-container-1.1" class="outline-3">
<h3 id="sec-1.1"><span class="section-number-3">1.1</span> Abstract </h3>
<div class="outline-text-3" id="text-1.1">

<p>Arising out of an attempt at a new foundations of mathematics, in which relations are more primitive than sets, and out of the theoretical physicists' concept of underlying causes of empirical phenomena, the idea of a purely mathematical possible world (of underlying causes) is developed. It is shown that at least one, and at most one, possible world is actual, and that the one that is actual is the best (as in the philosophy of Leibniz), and therefore requires the cosmic coincidences to exist. This best is actual necessarily because of having a higher level top relation than any other possible world, and because of this top relation possessing the property of intrinsic necessary existence. 
</p></div>

</div>

<div id="outline-container-1.2" class="outline-3">
<h3 id="sec-1.2"><span class="section-number-3">1.2</span> The Problem of Cosmic Coincidences </h3>
<div class="outline-text-3" id="text-1.2">

<p>The <i>Problem of Cosmic Coincidences</i> refers to the improbability
of certain parameters in theoretical physics having the values
that they do. Following Lee Smolin (Smolin, 1997) Robinson lists
four solutions to this problem:
</p>
<ul>
<li>
Anthropic explanation
</li>
<li>
Fine-tuning explanation
</li>
<li>
One consistent mathematical system
</li>
<li>
Universes emerge from black holes

</li>
</ul>

<p>For Robinson, none of these options are satisfactory, so he posits
a fifth explanation, which derives from the work of GW Leibniz.
Leibniz claims that the "actual world exists necessarily because
it is the best of all possibles." The world that Leibniz refers
to is not the world of empirical phenomena that we experience, but
rather the world of underlying causes of these empirical phenomena.
</p>
<p>
So for Robinson, there are two worlds, the <i>EMPIRICAL WORLD</i> and 
the <i>UNDERLYING WORLD</i>, and it is crucial for the argument that 
we are clear about which of these worlds that we are talking about.
</p>
<p>
The core of the argument rests on the concept of <i>NECESSARY EXISTENCE</i>
or <i>ACTUALITY</i>. According to Robinson: "If this concept is neither 
self-contradictory nor implies a contradiction, then whatever has
this necessary existence must exist in at least one among all 
possible worlds, making that one possible world actual."
</p>
</div>

</div>

<div id="outline-container-1.3" class="outline-3">
<h3 id="sec-1.3"><span class="section-number-3">1.3</span> Relational Philosophy of Mathematics </h3>
<div class="outline-text-3" id="text-1.3">

<p>Robinson's argument rests on a philosophy of mathematics
based on relations rather than sets. According to Robinson,
in set theory, the defintion of relations "involves a 
vicious circle": the definition of relations as subsets
of Cartesian products presupposes the relation of set
membership and the relations of logical argument forms.
</p>
<p>
Since relations (arguably) are more important than sets
in mathematics, and sets can be defined easily in terms
of relations, relations should be made fundamental in
mathematics.
</p>
<p>
Once relations are made fundamental, we can distinguish
between three kinds of defined sets:
</p>
<ul>
<li>
Intensional sets
</li>
<li>
Extensional sets
</li>
<li>
Nominal sets

</li>
</ul>

<p>The <i>INTENSION</i> of a set (if it has one) is all those properties
that all and only its members possess.
</p>
<p>
The <i>EXTENSION</i> of a set is the totality of its members.
</p>
<p>
A <i>NOMINAL SET</i> is a set that has a name or a description but
otherwise does not exist.
</p>
<p>
From this we obtain three kinds of mathematical meaning: intensional,
extensional and nominal meaning. Only nominal meaning can lead to
contradictions or paradoxes, while only intensional meaning can
have axiom generosity.
</p>
<p>
Intensional meaning is essentially relational: relations and 
their properties constitute relational meanings. Thus, if 
mathematics is to be rich and consistent, it must be confined
to intensional meaning. This leads to the conclusion that
many common concepts have no intensional meaning. For instance,
neither the concepts <i>INFINITY</i> or <i>CHANCE</i> have intensional
meaning.
</p>
</div>

</div>

<div id="outline-container-1.4" class="outline-3">
<h3 id="sec-1.4"><span class="section-number-3">1.4</span> Properties of Relations </h3>
<div class="outline-text-3" id="text-1.4">

<p>In the paper, Robinson identifies a variety of properties of relations in 
general.
</p>
<p>
A relation has <i>TERMS</i> which are what it relates.
</p>
<p>
All and only relations have terms. The number of terms a relation 
has is called its <i>ADICITY</i>.
</p>
<p>
We can see (hear,touch,smell,taste,etc.) relations, but we cannot 
say what they look like. For instance, we can see that a hat is
on his head, but what does "on" look like?
</p>
<p>
Relations cannot exist if their terms do not exist, and if their
terms do exist the terms must be appropriately arranged for the
relations to exist. When arrangements of terms change so as to
have a relation come into existence, we say that the relation
<i>EMERGES</i> out of those terms and that arrangement. Likewise,
if a change of arrangement causes the relation to go out of 
existence, the relation is said to <i>SUBMERGE</i>.
</p>
<p>
Relations may be terms of other relations.
</p>
<p>
Relations have <i>INTRINSIC PROPERTIES</i>, by which they can be
distinguished. They also have two kinds of <i>EXTRINSIC PROPERTIES</i>.
</p>
<p>
There are two kinds of extrinsic properties:
</p><ul>
<li>
The terms of the relation
</li>
<li>
The other relations of which they are terms (Upper Extrinsic Properties)

</li>
</ul>

<p>The instrinsic properties of a relation determine the <i>KIND</i>
of the relation they are, and their terms determine the
<i>INSTANCE</i> of that kind.
</p>
<p>
Relations form what might be called <i>NATURAL SETS</i>: the sets of
their properties, the sets of their terms, and the sets of their
upper extrinsic properties.
</p>
<p>
Relations have a value, called their <i>HEKERGY</i>. If the number
of arrangements of the terms of a relation with which the 
relation emerges is <i>e</i> and the total possible number of
arrangements of of the terms is <i>t</i> then the hekergy of that
relation is <i>ln(t/e)</i>. Hekergy is a generalization to relations
of negative (or negated) entropy.
</p>
<p>
A <i>STRUCTURE</i> is an arrangement of relations relating relations
which relate relations, to various levels. The lowest level of
these relations is called the <i>PRIME LEVEL</i> of the structure.
Relations at the prime level are called <i>SEPARATORS</i>; they 
are characterized by being both terms and relations of these
terms. In general (with two exceptions) each level consists
of structures of lower level structures and various combinations
of separators between them. The exceptions are the prime
level and the top level.
</p>
<p>
A structure which has many levels of emergence is said to
have <i>CASCADING EMERGENCE</i> out of its prime level. Because
a structure consists of two or more substructures, the
number of structures in a level is smaller than the number
of structures in the next level below.
</p>

</div>

</div>

<div id="outline-container-1.5" class="outline-3">
<h3 id="sec-1.5"><span class="section-number-3">1.5</span> Possible and Actual </h3>
<div class="outline-text-3" id="text-1.5">

</div>

</div>

<div id="outline-container-1.6" class="outline-3">
<h3 id="sec-1.6"><span class="section-number-3">1.6</span> Summary of Argument </h3>
<div class="outline-text-3" id="text-1.6">


</div>

<div id="outline-container-1.6.1" class="outline-4">
<h4 id="sec-1.6.1"><span class="section-number-4">1.6.1</span> Overview of what has been said so far </h4>
<div class="outline-text-4" id="text-1.6.1">

<ul>
<li>
At most one possible world can be actual
</li>
<li>
At least one possible world must be actual
</li>
<li>
At most one possible world containing a relation possessing INE can exist
</li>
<li>
At least one relation possessing INE must exist

</li>
</ul>

<p>The only way in which all these four conditions can occur together
is if this relation possessing INE emerges as the top relation of a
possible world having a higher top level than any other possible
world, which makes the relation possessing INE unique among all
possible worlds. The possible world possessing this unique relation
must be the best of all possibles <b>G</b>. This unique relation must
be <b>T</b>, possessing the emergent property of INE. Thus:
</p>

</div>
</div>

</div>

<div id="outline-container-1.7" class="outline-3">
<h3 id="sec-1.7"><span class="section-number-3">1.7</span> Bibliographic Information </h3>
<div class="outline-text-3" id="text-1.7">

</div>
</div>
</div>
<div id="postamble">
<p class="author"> Author: Greg
<a href="mailto:greg@greg-Satellite-C855D">&lt;greg@greg-Satellite-C855D&gt;</a>
</p>
<p class="date"> Date: 2013-09-03 15:42:34 EDT</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
